"""
Дан список размера N. Найти номера тех элементов список, которые больше своего
левого соседа, и количество таких элементов. Найденные номера выводить в
порядке их убывания.
"""

lst = [12,24,123,6,178,3,63,1234,1,23,4,2]
"""
counter = 0
for numbers[counter] in numbers:
    counter +=1
 #   print(numbers[counter] , numbers[counter-1])
    if numbers[counter] > numbers[counter-1]:
        print(numbers.index(numbers[counter]))
        """
