info_items=[
    (1, 'Бондарев', 'Сергей', 'Анатольевич', '02-11-2005', True, 'г.Ростов-на-Дону', 'Программист'),
    (2, 'Ковалкин', 'Артём', 'Константинович', '31-10-2006', False, 'г.Аксай', 'Программист'),
    (3, 'Меркулов', 'Никита', 'Владимирович', '27-03-2006', True, 'г.Санкт-Петербург', 'Информационная безопасность'),
    (4, 'Рычков', 'Данил', 'Викторович', '02-02-2006', False, 'г.Новошахтинкс', 'Системный администратор'),
    (5, 'Гречанок', 'Кирилл', 'Демьянович', '14-03-2007', True, 'г.Ростов-на-Дону', 'Бухгалтер'),
    (6, 'Коренной', 'Никита', 'Владимирович', '07-10-2006', True, 'х.Победа', 'Программист'),
    (7, 'Марзимян', 'Азул', 'Эбекович', '28-12-2005', False, 'г.Азов', 'Связист'),
    (8, 'Барабиджан', 'Рамел', 'Парисонович', '21-08-2006', False, 'г.Батайск', 'Программист'),
    (9, 'Зазулин', 'Саманет', 'Таприч', '17-09-2007', True, 'г.Ростов-на-Дону', 'Бухгалтер'),
    (10, 'Валуев', 'Владимир', 'Викторович', '11-05-2006', True, 'г.Ростов-на-Дону', 'Программист'),
]